[
    
    {
        "id" : 295037,
        "title" : "好奇心：大家搞出过最严重的 BUG 是什么?",
        "url" : "http://www.v2ex.com/t/295037",
        "content" : "1.金钱损失。\u000D\u000A2.数据损失。\u000D\u000A\u000D\u000A刚刚改的一个小bug，造成了金钱损失好几百，感觉心里过意不去。",
        "content_rendered" : "\u003Cp\u003E1.金钱损失。\u000A2.数据损失。\u003C/p\u003E\u000A\u003Cp\u003E刚刚改的一个小bug，造成了金钱损失好几百，感觉心里过意不去。\u003C/p\u003E\u000A",
        "replies" : 127,
        "member" : {
            "id" : 117917,
            "username" : "angusun",
            "tagline" : "",
            "avatar_mini" : "//cdn.v2ex.co/avatar/e351/e860/117917_mini.png?m=1463912003",
            "avatar_normal" : "//cdn.v2ex.co/avatar/e351/e860/117917_normal.png?m=1463912003",
            "avatar_large" : "//cdn.v2ex.co/avatar/e351/e860/117917_large.png?m=1463912003"
        },
        "node" : {
            "id" : 300,
            "name" : "programmer",
            "title" : "程序员",
            "title_alternative" : "Programmer",
            "url" : "http://www.v2ex.com/go/programmer",
            "topics" : 12690,
            "avatar_mini" : "//cdn.v2ex.co/navatar/94f6/d7e0/300_mini.png?m=1469447538",
            "avatar_normal" : "//cdn.v2ex.co/navatar/94f6/d7e0/300_normal.png?m=1469447538",
            "avatar_large" : "//cdn.v2ex.co/navatar/94f6/d7e0/300_large.png?m=1469447538"
        },
        "created" : 1469517771,
        "last_modified" : 1469517887,
        "last_touched" : 1469588659
    },
    
    {
        "id" : 295041,
        "title" : "父亲即将退休，不想闲着想找个其他事情做，如果卖早餐的话，卖什么比较好。",
        "url" : "http://www.v2ex.com/t/295041",
        "content" : "老爸近一两年估计就要内退了，在家闲不住，平时喜欢钓鱼，想着给他找点事做，一个是 uber 滴滴司机，但是比较担心安全问题，二个就是早餐了，上午忙乎一阵，下午该干嘛干嘛，还不少赚，因为在公司周围真的是没发现好的早餐，但是早餐又不能做起来太麻烦，大家有什么好的意见，简单快捷的那种",
        "content_rendered" : "\u003Cp\u003E老爸近一两年估计就要内退了，在家闲不住，平时喜欢钓鱼，想着给他找点事做，一个是 uber 滴滴司机，但是比较担心安全问题，二个就是早餐了，上午忙乎一阵，下午该干嘛干嘛，还不少赚，因为在公司周围真的是没发现好的早餐，但是早餐又不能做起来太麻烦，大家有什么好的意见，简单快捷的那种\u003C/p\u003E\u000A",
        "replies" : 72,
        "member" : {
            "id" : 163724,
            "username" : "gjx870327",
            "tagline" : "",
            "avatar_mini" : "//cdn.v2ex.co/avatar/a847/57e8/163724_mini.png?m=1467784132",
            "avatar_normal" : "//cdn.v2ex.co/avatar/a847/57e8/163724_normal.png?m=1467784132",
            "avatar_large" : "//cdn.v2ex.co/avatar/a847/57e8/163724_large.png?m=1467784132"
        },
        "node" : {
            "id" : 12,
            "name" : "qna",
            "title" : "问与答",
            "title_alternative" : "Questions and Answers",
            "url" : "http://www.v2ex.com/go/qna",
            "topics" : 73243,
            "avatar_mini" : "//cdn.v2ex.co/navatar/c20a/d4d7/12_mini.png?m=1468770261",
            "avatar_normal" : "//cdn.v2ex.co/navatar/c20a/d4d7/12_normal.png?m=1468770261",
            "avatar_large" : "//cdn.v2ex.co/navatar/c20a/d4d7/12_large.png?m=1468770261"
        },
        "created" : 1469519391,
        "last_modified" : 1469519391,
        "last_touched" : 1469591762
    },
    
    {
        "id" : 295005,
        "title" : "创业，是一种生活态度",
        "url" : "http://www.v2ex.com/t/295005",
        "content" : "这不是一碗鸡汤，也不是一个励志的故事，只是一年多的时间换回的经验教训和搞笑段子。\u000D\u000A\u000D\u000A**[原始出处，图文并茂版]( https://mp.weixin.qq.com/s?__biz\u003DMzI2NzA4MDk0Mg\u003D\u003D\u0026mid\u003D2651148704\u0026idx\u003D1\u0026sn\u003Db4466e66acc23604524d8a82080c351e\u0026scene\u003D1\u0026srcid\u003D0726t1JTfBGCvryX7HFP8Qmi\u0026key\u003D8dcebf9e179c9f3a97b168cfc2b780d9c78792d4b2ef704cf6d197cd08612c76912dc68fe31c72c64ea5d910cca04c2b\u0026ascene\u003D0\u0026uin\u003DNDQ2MjY3OTYw\u0026devicetype\u003DiMac+MacBookPro12%2C1+OSX+OSX+10.11.6+build(15G31)\u0026version\u003D11020201\u0026pass_ticket\u003DRn99nGWVglAKYD9bYTw9B3Qtid0jjTIdJpVsTxYDt9zK%2FhrbsHnZkWUWPDz%2BpXFw)**\u000D\u000A\u000D\u000A\u000D\u000A\u000D\u000A懒汉专用文字版\u000D\u000A\u000D\u000A\u000D\u000A还记得一年多以前，告别了自己喜欢的一家公司，开始了自己的创业。离职的时候，夫人还在调侃的问：“难得有一家彼此看对眼的公司，你就这么走了？你就不惋惜？” \u000D\u000A​\u000D\u000A惋惜嘛……当然是有的，一个逗比生活在一群逗比里，这种组合确实不多见。组织架构扁平，打的上交道的同事之间沟通也是直来直去，都是很努力的小伙伴，还有时间能研究些纯技术的东西，日子过得也还算惬意。\u000D\u000A\u000D\u000A当时一冲动买房子也是按照老东家的办公地点做圆心选址的有木有，那时候想着，在这里怎么也能做个 56789 年吧！其实放一年后的现在看，我也搞不懂自己为啥脑抽非要跑出去专心创业去。\u000D\u000A\u000D\u000A还记得老东家当时说，反正最近组织架构在调整中，你闲就闲点公司又没怪你闲着，你有啥想研究的就自己研究，鼓励你研究。但是我就是一个内心极其爱作死的人，拿人钱财不与人消灾，良心难安。嗯，现在看有一种分分钟想打脸的感觉。 人生，有钱赚，有命花，有喜欢的事做，不伤天害理，不偷鸡摸狗，那就很好了。这一直是我的准则啊，我怎么就这么想不开非要跑出去吃土创业呢？\u000D\u000A\u000D\u000A大概我骨子里就是一个闲不下来的人吧，闲下来生命就感觉空虚寂寞冷了，以我们现在的科技再加上程序员的自虐程度，能活个五六十年就不错了，生命在于折腾啊！\u000D\u000A\u000D\u000A当然，这不是一篇讲述我创业成功从此财务自由走上人生巅峰，帮儿子 [对不起，本人已婚] 迎娶白富美打造人生巅峰的励志故事。\u000D\u000A\u000D\u000A故事到这里急转直下，半年里经历了一些万万没想到的原因，创业的事情不得不终止了。创业九死一生一点都不夸张，九十九死一生都不是在吓唬人，而且九十九个死法还能不带重样的╰(￣▽￣)╮想做的事情做不了，那段时间是一个低谷期吧，人生总是要继续的，搬不了自己的砖，那就继续给别人搬砖呗。\u000D\u000A\u000D\u000A可是去哪呢？去大公司吧，我是个性格脾气都有些古怪的人，那种方圆几公里全是同事的感觉，太奇怪了。工作按照 KPI 来，这样的日子，真心话，无聊。\u000D\u000A\u000D\u000A运气不好点，在碰点办公室政治，日子过的那才叫窝心。然后老司机告诉你，你要学会站队，学会做人。我的天哪，听得鸡皮疙瘩都下来，活了都快 30 年的人了，如果是这样的工作状态，我干嘛当年还不顾家人的反对远离家乡，和别人一样送送人情，抱抱大腿，就在当地的全球 500 强国企里混混日子不也和现在处境一样？不就是不认同这样的规则么？为什么绕了一大圈我又需要变成这样的人呢？\u000D\u000A\u000D\u000A要是再惨一点，你要是碰上个技术渣的一比的老大，绩效奖金什么的，其实就是要懂得如何用 1024 种姿势拍领导马屁，哦，对了，他们管这个叫情商，你要会做人，当然对这种能力我还是挺佩服的，这事我是学不会，也懒得学。不过我自己才没有这么眼瞎好吗？！这些老大都是空降或者半路杀出来的，不过这也算是少数案例啦，但是你要是真赶上那绝对是吃不消啊。当然我是不会告诉你们我是怎么知道这事的。\u000D\u000A\u000D\u000A但是严肃点， KPI 指标的量化在落地过程中，指标是否真实的反映工作量？是否公正客观？本来就有很大的漏洞或者说是可操作空间。最常见的例子，同样的开发任务，一个人做的是脏活累活对项目是必须的，但不能为公司带来利润，一个人做的是简单的开发任务但是显著提高了公司的利润。\u000D\u000A\u000D\u000A那么问题来了，奖金是有限的，这两个人哪个人应该给更高的分数拿更多的奖金呢？答案很难统一，也很难说谁对谁错，不同的企业文化和直属领导的偏好都会影响最终的结果。\u000D\u000A\u000D\u000A还有那些奇葩的 ABCDE 档设定，一定要有人在 E 档的神奇规定，凭什么我的团队就不能每个人优秀了？我个人是非常鄙视 KPI 这种制度的，我更加鄙视那种把 KPI 引进团队的 CTO 们，特别是 KPI 不应该用在一个有高度自律性的团队中，这对团队成员是一种伤害。最后在这种奇葩的制度下，每一名工程师血液里流淌着的创造天赋在一点点被消磨，而这一份天赋公司付出了薪水，却在白白的浪费而不自知！\u000D\u000A\u000D\u000AWhy join th Navy, if you can be a pirate? 我们人类生来就是为了改造这个世界的，我一直坚信，我们可以犯错，但我们不能停下创造的脚步，只要不违法不违反自己心中的道德底线，什么事你都可以去试试。\u000D\u000A\u000D\u000A这就是我的价值观，所以结局也是显然的，再一次，我就又被自然而然的勾搭到创业公司搬砖了，这一次是排叔，蛋壳公寓的创始人之一。\u000D\u000A\u000D\u000A小排是我的前同事，也算是前领导，因为中间来客串管理过我们的项目。公司本身就是扁平化的管理，又是一群逗比，所以平常嘻嘻哈哈就过去了。\u000D\u000A\u000D\u000A排叔对项目预估一向都很客观，不急不燥，这是我很喜欢的点，不像有的老大，拍拍脑袋感觉你这个东西简单，从来不想想背后还缺什么。急功近利，互联网里这样的人太多了，能和这样的人一起做一件事，是一种幸福。\u000D\u000A\u000D\u000A\u003D\u003D\u003D\u003D\u003D这是一条华丽丽的分割线\u003D\u003D\u003D\u003D\u003D\u000D\u000A\u000D\u000A真正的故事就这么开始了，还记得开始勾搭我的时候，小排在哭穷，公司多么多么穷，我能给你的尽量给，当然给的也很有限，我们有多穷呢？穷到夫人知道我们谈的薪资标准坚决不同意我去的地步\u003D \u003D|||创业可以有，不过养家糊口也得照顾现实吧。\u000D\u000A\u000D\u000A当时电脑都是自己的，公司只配一台 23 寸的戴尔显示器，还记得我们在上海租的办公室，后面墙皮都脱落的一块一块的，这样也太寒酸了，怎么办？这时机智的嫂夫人（小排的太太）想了个办法，我们挂个世界地图吧。 \u000D\u000A\u000D\u000A\u000D\u000A这个开端放在创业公司里也算是寒酸了，现在动辄拿个几千万 A 轮风投的项目，开烧投资人钱的哪家不都展示出各种对程序员无尽的关怀和无尽的福利啊，顶配 MBP ，饮料餐饮下午茶这都快是标配了，再有的一万块一把的椅子，连程序员鼓励师都已经以按摩师的姿态成功落地上线了，单身的一定要解决掉伴侣问题，就为了让这帮脑子在非技术人眼中多少有点不太正常就是能创造价值的人安心干活，我必须得承认，真的是够拼的……\u000D\u000A\u000D\u000A当然我觉得他们烧钱没错，任何一家公司愿意砸钱给哪个角色，取决于他们的业务驱动方是谁，所以你不会看到在传统企业里，把程序员们捧上天，也不会看到，在互联网公司里把 sales 捧上天。\u000D\u000A\u000D\u000A我们现在的生意，整体还是偏线下，在蛋壳，我们是强大的生产力，但我们不是业务的驱动方，我们只是幕后英雄。\u000D\u000A\u000D\u000A所以面子功夫差一点就差一点呗，而且你真以为你赚了么？你就不想想这些钱到底是拿整个公司多少股权换来的？你是愿意和创始人一起现在省一省将来大家蛋糕多分一些？还是把大蛋糕分给投资人换自己的提前享乐？\u000D\u000A\u000D\u000A当时夫人就特别不理解为什么我一定要来帮好基友搞这摊子事情，没事给自己找罪受，我觉得出来创业，一半看事情有没有前途，一半看创始团队给不给力。\u000D\u000A\u000D\u000A这些创始人都是很务实的人，我喜欢他们那一份不急功近利的心态和务实的风格。快速迭代和务实，本来就不冲突。他们真的懂。这样的人，至少在这个行业里我能遇到的人，真的不多见。\u000D\u000A\u000D\u000A从事情上看，在外行人眼中，几乎所有人都觉得我们是二房东，是的我们在你们眼中很 Low ，但我们做的东西未必 Low 。我们内心还是拒绝这个称呼的好吗？我只喜欢站着还能把钱赚了的生意，这件事情从内心讲我并不认为足够的高尚，但是在国情下，这绝对是一种合理的解决方案。在这个越来越多的年轻人涌入到北上广深谋出路的时代，帮他们住的好一点，我们也赚一些钱，对彼此都不是坏事。\u000D\u000A\u000D\u000A而且这门生意比我能在这聊天扯淡的空间多的多，其实游戏才刚刚开始，不过篇幅有限，暂时大家也可以理解为二房东。好的生意都是能用一句话说清楚盈利模式的。 二房东三个字足以让大家简单理解。\u000D\u000A\u000D\u000A可话说回来，就算是二房东，二房东会帮你提供免费公共区域双周保洁么？二房东会遵循国家标准，不违章改造么？二房东会在改造房屋时，注重隔音效果好坏么？二房东会给你使用环保的装修家具和材料么？不用付三押一，不用担心黑中介，换工作了现在住的房子离公司远，还能免扣押金换个同样蛋壳公寓的屋子，这样厚道又机智的二房东你从哪里找？\u000D\u000A\u000D\u000A如果放在八九年前北漂的我，我能遇到这样的房东，我很激动的就签签签，住住住了好吗？就连票房收割 10 亿+做《煎饼侠》的大鹏导演曾经都分享成功经验提到“当年搜狐在哪，他把房子租到哪，为的比别人多一个机会”。虽然我们这种职业，不怎么需要他那样争取机会的模式，闷声做东西就行了，但是你要知道，八九年前还没有这些牛逼的 iphone ， kindle 这些可以充分利用碎片时间的装备，你的时间也是钱啊！周边太贵住不起，黑心房东隔断房简直就不把人当人，要么忍要么滚，做不到鹏哥的忍耐力，当然或许真相是也许没人家薪水多 T_T 所以只好住的远一点，上下班一天奔波三个小时，中途还遭遇过房东说退就退的尴尬境遇，通常做法都是我按合同补你钱啊，实际上租客没有话语权，补钱搬家什么的哪里划算了？周边房价一涨，再租更贵，还有搬家的成本，再找中介的中介费！都是一把辛酸泪。\u000D\u000A\u000D\u000A\u000D\u000A每个人不同的阶段，都有不同的烦恼，这个阶段的我，找个工作容易，找个公司钱景大好的 \u0026\u0026 能从零开始一点点打造心目中技术金字塔的公司，很难。蛋壳公寓，是一家。\u000D\u000A\u000D\u000A虽然这家公司成立一年多，但是技术团队的真正搭建并没有多久，进入这家公司半年多，创业之初，着实不易，其实我们遭遇了很多很多可笑可气又奇葩的事。没办法，这就是创业，你不能只想拥有他成长光鲜的一面，而不去经历成长的烦恼。创业，她有光鲜的外衣，也有内心的苦楚。\u000D\u000A\u000D\u000A当时上海的办公室为了考虑地段，但是预算有限啊，只能牺牲设施条件，我们租了一间商住合一的公寓，名字都带公寓。这为我们带来不让尴尬的处境……\u000D\u000A\u000D\u000A记得有一次电面个妹纸，她最后问我，你们不会是骗纸吧…… 我后来机智的回答说：“妹纸，我们不是，你不要误会，我们真的不是坏人，虽然从骗纸的行骗手段来说，确实租在这种地方很像骗纸，但是你见过电面这么专业的骗纸么？而且这种骗纸通常都是骗取中介费，我们面试不收钱的好不好？骗色的也有，但是违法成本太高，一般人没这个胆，而且你不放心可以叫几个汉纸过来一起面，完全没问题，你甚至可以提前报警……” 从此我的人生又多了一条尴尬的人生经验。\u000D\u000A\u000D\u000A我们还经历过好不容易招来一个前端，当时虽然感觉这个人有点心浮气躁，但是缺人啊，我跟排商量了下就放进来了（再一次证明，请不要违反 Hire slow,Fire fast 原则），结果这哥们周五报到，周一来上班一天，周二直接招呼不打就跑路了……\u000D\u000A\u000D\u000A我还记得周二我到公司，嫂夫人告诉我说：“这哥们好像不来了，你看桌子上的杯子都收走了。” 我都不敢相信，微信发消息，电话打了好几个都没人接，卧槽我的脑洞不由自主的扩散都开始想这哥们不会是在自己屋子里猝死了吧，我们这行很容易猝死的啊！！！这孩子在外面打拼也不容易，合同上好像也没留个紧急联系人的，他父母会不会担心啊？尼玛合同上为什么没设置紧急联系人啊，尼玛怎么设计合同的啊！以后合同要改进好不好，唉不对正事要紧……急得我都想打 110 报警了。\u000D\u000A\u000D\u000A直到过了三四天我在想最近上海也没报出什么某年轻男子猝死家中尸体腐烂邻居报警之类的新闻应该确实是跑路了，不过安全起见，我又使用各种搜索技能挖出他某乎的账号，这哥们居然在发帖，是的，他在发帖！！！当然知道他活着，虽然被坑了，我也就放心了。但我当时内心突然真是十万只草泥马奔腾而过啊！ WTF 啊尼玛！卷了我们项目一个多月的工作成果跑路这是什么素质啊！而且看样子他好像不声不响的还在之前那家公司继续工作着啊卧艹艹艹艹！！！虽然半年后这代码我都觉得垃圾不屑一看但你这样的行为简直是个渣渣啊！我祝你人贱有天收好不好！！！\u000D\u000A\u000D\u000A后来还有个实习生，做的也不咋地（当时和那个小哥前后脚入职的，同样违反了 Hire slow,Fire fast 原则）开了。小的创业公司，没什么名气，我也是个懒得到处去刷脸的人，也没空勾搭人。于是盛怒之下，算了，不招了，一个人大不了累点燃烧点生命，两条大产品线一个人撸，上个 0.1 版本还是能扛得住的。\u000D\u000A\u000D\u000A于是就这样，半年多过去了，我们的很多功能也就这样一点点的扛了过来。在这期间，我们的工作模式也发生了变化。 \u000D\u000A\u000D\u000A从最开始小排勾搭我的 remote 模式到全职模式，我想了想还是觉得全职模式比较好，不过后来在一天 4 小时车程的碾压下，我从一个书虫已经变成了看书看到想吐的结局，最后还是走上了 remote 模式。最后又发展为整个技术团队（一共 4 个人，其中还有一个实习生）走上了 remote 模式。再到后来，小排直接把上海的办公室退掉了，公司总部在北京，我们相约定期去北京做 review 。从此过上了相约星期六，有情就牵手， 见面不是基，面基才是基的生活。\u000D\u000A\u000D\u000A于是这半年的职业生涯我就变成了这样的：\u000D\u000A\u000D\u000A在别人家的办公室 Coding ……  \u000D\u000A [我建议不要去不搞互联网的公司……原因是网！太！烂！啦！] \u000D\u000A\u000D\u000A在火车上 Coding ……  \u000D\u000A [感谢中国电信，高铁全程覆盖，感谢降噪耳机，世界仍然是安静的……] \u000D\u000A\u000D\u000A在景区 Coding …… \u000D\u000A [成为别人的外挂，有山有水有代码，哎呦，不错哦……] \u000D\u000A\u000D\u000A在家里 Coding …… \u000D\u000A [爸爸，爸爸，这个是 A …… 这个是 W …… 哎哎哎~~等下、等下我的代码……感谢 History 功能……] \u000D\u000A\u000D\u000A在咖啡厅 Coding ……\u000D\u000A [唉……隔壁又在很大声的聊，我的项目是做…… 我现在需要 x 百万美金……我手抖都不带抖的继续 Coding ……今天都没有报价过千万的，排名不行啊] \u000D\u000A\u000D\u000A\u000D\u000A其实有时候想想，这样的状态，也还不错。\u000D\u000A虽然身心在这家公司被需求方轮了那真是一遍又一遍 O__O\u0022…\u000D\u000A可在其他厂不还是一样被轮？虽然可能轮的没那么复杂没那么闹心没那么丧心病狂……何况解决一个复杂的问题，比解决一个简单的问题成就感高多了好么？\u000D\u000A\u000D\u000A“生活不只眼前的苟且，还有诗和远方的田野。”我现在两者不都同时拥有了吗？还有什么好烦恼的呢？\u000D\u000A\u000D\u000A以前我还挺担心 remote 效率的，实际体验下来，其实效果很好，当然了，已婚的如果没人帮带孩子， remote 你还是别考虑了。\u000D\u000A\u000D\u000A\u003D\u003D\u003D\u003D\u003D这是一条华丽丽的分割线\u003D\u003D\u003D\u003D\u003D\u000D\u000A\u000D\u000A最重要的是，我们现在从探索期进入了稳定探索期，工作配置也越来越好了，公司正式给开发配置了 MBA ，我们的配置终于跟上了业界标准，争取明年实现高大上， MBP 什么的，走起来。至少现在我有勇气可以跳出来勾搭勾搭人了，太苦的坑，我是不会让你们跳的。\u000D\u000A\u000D\u000A经过我们这段时间的 remote 尝试，我和需求方对 remote 方式是完全认可的，当然啦！并不是所有的业务都适合做 remot ，各位看官请自行根据业务评估是否适合 remote ，千万别盲目套用，不过我们可以确定我们的业务线非常适用，接下来，我们需要把 0.1 版的产品推到 0.8 版。\u000D\u000A\u000D\u000A所以，有兴趣入坑的 python 同学注意了，这里有 2 个钱景不错的工作机会等你来哦，不拒绝新手，毕竟前期很多脏活累活都撸清楚了，没有以前那么夸张的强压任务，当然快速迭代还是需要的：\u000D\u000A\u000D\u000A产品方向：\u000D\u000A\u002D 实现数据和公司流程相关的产品\u000D\u000A\u000D\u000A工作内容：\u000D\u000A\u002D 在业务框架上实现业务功能，基于 Django 实现\u000D\u000A\u002D 竞争对手数据监控\u000D\u000A\u000D\u000A技术栈：\u000D\u000A\u002D 熟练使用 django 、 scrapy\u000D\u000A\u002D 熟练使用 mysql\u000D\u000A\u002D 熟练使用 redis\u000D\u000A\u002D 熟悉 html/js/css\u000D\u000A\u002D 无 github 账户者不考虑\u000D\u000A\u000D\u000A人品栈：\u000D\u000A\u002D 善良\u000D\u000A\u002D 诚实\u000D\u000A\u002D 聪明 [聪明这种属性我一直想不明白干嘛大家都列出来呢？\u000D\u000A如何证明一个人当前的成果是努力来的还是天赋呢？] \u000D\u000A\u000D\u000A\u000D\u000A希望你们都是能独当一面的勇士。\u000D\u000A工作地点为 remote ，但要求 base 在上海或北京，上海范围至多江浙沪。定期可以出来聚一聚、吃吃饭、扯扯淡。\u000D\u000A\u000D\u000A另外，虽然是 remote ，你不能失联，我的标准是：\u000D\u000A\u000D\u000A工作的 8 小时时间内， 5 分钟甚至是绝大多数时间即时回复，我认为这个要求不过分。 工作之外的时间，不做特别硬性的规定，但至少我们都是一群精力过剩的晚上 23 点还能抓到的人，真有事情需要能找到人，这也算是 remote 的缺点吧。在我看来，并无所谓，创业，只是一种生活态度。希望能遇到志同道合的人。\u000D\u000A\u000D\u000A\u000D\u000A欢迎推荐或自荐，有意向者，请发送简历及期望薪酬至 wangwenpei@dankegongyu.com\u000D\u000A\u000D\u000A按国际惯例总要介绍下自己，虽然说了其实别人也不知道是谁，世界这么大，谁知道谁是谁，何况我又不是小网红，有兴趣还是来一起共事吧 XD\u000D\u000A\u000D\u000A在公司大家一般都叫我风 xx （已经默默的被接受了这个花名，你们这群文盲…… 算了花名好记点也没坏处），性别直男无癌，已婚。\u000D\u000A\u000D\u000A我在这家公司担任架构师的职务，从业差不多 10 年，就职过大概四、五家公司，大中小都呆过，名字表过不提了吧，有喜欢的公司，也有看不起的公司。\u000D\u000A\u000D\u000A有上市的、有被并购的，还有上市后被出售的， 10 年过去回头看看真是唏嘘不已，这大概就是互联网的江湖吧，我也不过是整个江湖中的一粒沙而已。\u000D\u000A\u000D\u000A一般会被人当 Full Stack ，但我始终觉得是种调侃╮(╯▽╰)╭我也不知道这词啥时候火的，反正我觉得自己只是一名工程师而已，无非活久见，撸着撸着就跨界了，骨子里有那么点文艺气息以及作死之力？所以对跨界的事也不并嫌弃，不然也不会这么能唠跟你唠这十块钱的。\u000D\u000A\u000D\u000A其实我一直觉得好的产品就是科技与人文的结合体，只保持工程师思维最多只能保证架构的稳定，但没有办法做出优秀的产品，而且很有可能最终你的架构因为视角太小都会是糟糕的，讲这话有点心虚，毕竟我又不是小网红，怕被骂神经病，没啥影响力，所以摆出大神辟邪，前几天正好看到的一个纪录片，内心产生了不能自已的共鸣，要喷请先喷他 XD\u000D\u000A\u000D\u000A\u000D\u000A\u000D\u000A\u000D\u000A\u000D\u000A\u000D\u000A\u000D\u000A\u000D\u000A个人成就上一直在为公司贡献代码，对内的、对外的、注重并发的、注重大数据的都有负责或参与过，公司的项目就不自曝了，免得回头踩线你们懂得。\u000D\u000A\u000D\u000A开源的东西，目前没有什么特别牛逼的拿得出手的开源项目，现在 star 数量最多的大概是给 mongoengine （级别 1000+ star ）加过点 feature ，开发中用到的开源项目，有空我都会 hack 一点，社区运作规范活跃，做测试用例简单的话有时候我也会回馈给开源社区。比起各种大牛来，前方路途仍然遥远，同志仍需努力。\u000D\u000A\u000D\u000A个人还是很喜欢 django 和 python ，不管现在的技术趋势如何，重要的是能坚持深入。大概就是这样，以上情况本人承诺真实有效，可自行去 https://github.com/9nix00 人肉围观验证。求吐槽手下留情。\u000D\u000A\u000D\u000A总之，希望能遇到和自己有相同想法的人，一起来把这件事情做成。 符合技术栈对 remote 也能适应的小伙伴欢迎投递简历至 wangwenpei@dankegongyu.com ，注明岗位和期望薪酬，附 github 账号、作品。没 github 的对不起我们不收。\u000D\u000A\u000D\u000A福利上，如上所说：\u000D\u000A\u002D 现在终于爬到了标准段位， MBA 什么的是终于可以上了。\u000D\u000A\u002D 有一份 99%的商业医疗保险\u000D\u000A\u002D 股票期权，目前策略是半年发一次。\u000D\u000A\u002D remote ？如果这个也算的话。\u000D\u000A\u000D\u000A创业与我，是一种生活态度，有钱赚，有命花，能做有趣的事情，家庭美满，我想是很多工程师心中一个简单而又美好的梦想。欢迎乘上这艘快船，一起踏上征程，无论结局如何，我始终相信一点，努力过的人，结局都不会太差。\u000D\u000A\u000D\u000A\u000D\u000A风爻",
        "content_rendered" : "\u003Cp\u003E这不是一碗鸡汤，也不是一个励志的故事，只是一年多的时间换回的经验教训和搞笑段子。\u003C/p\u003E\u000A\u003Cp\u003E\u003Cstrong\u003E\u003Ca href\u003D\u0022https://mp.weixin.qq.com/s?__biz\u003DMzI2NzA4MDk0Mg\u003D\u003D\u0026amp\u003Bmid\u003D2651148704\u0026amp\u003Bidx\u003D1\u0026amp\u003Bsn\u003Db4466e66acc23604524d8a82080c351e\u0026amp\u003Bscene\u003D1\u0026amp\u003Bsrcid\u003D0726t1JTfBGCvryX7HFP8Qmi\u0026amp\u003Bkey\u003D8dcebf9e179c9f3a97b168cfc2b780d9c78792d4b2ef704cf6d197cd08612c76912dc68fe31c72c64ea5d910cca04c2b\u0026amp\u003Bascene\u003D0\u0026amp\u003Buin\u003DNDQ2MjY3OTYw\u0026amp\u003Bdevicetype\u003DiMac+MacBookPro12%2C1+OSX+OSX+10.11.6+build(15G31)\u0026amp\u003Bversion\u003D11020201\u0026amp\u003Bpass_ticket\u003DRn99nGWVglAKYD9bYTw9B3Qtid0jjTIdJpVsTxYDt9zK%2FhrbsHnZkWUWPDz%2BpXFw\u0022 rel\u003D\u0022nofollow\u0022\u003E原始出处，图文并茂版\u003C/a\u003E\u003C/strong\u003E\u003C/p\u003E\u000A\u003Cp\u003E懒汉专用文字版\u003C/p\u003E\u000A\u003Cp\u003E还记得一年多以前，告别了自己喜欢的一家公司，开始了自己的创业。离职的时候，夫人还在调侃的问：“难得有一家彼此看对眼的公司，你就这么走了？你就不惋惜？”\u000A​\u000A惋惜嘛……当然是有的，一个逗比生活在一群逗比里，这种组合确实不多见。组织架构扁平，打的上交道的同事之间沟通也是直来直去，都是很努力的小伙伴，还有时间能研究些纯技术的东西，日子过得也还算惬意。\u003C/p\u003E\u000A\u003Cp\u003E当时一冲动买房子也是按照老东家的办公地点做圆心选址的有木有，那时候想着，在这里怎么也能做个 56789 年吧！其实放一年后的现在看，我也搞不懂自己为啥脑抽非要跑出去专心创业去。\u003C/p\u003E\u000A\u003Cp\u003E还记得老东家当时说，反正最近组织架构在调整中，你闲就闲点公司又没怪你闲着，你有啥想研究的就自己研究，鼓励你研究。但是我就是一个内心极其爱作死的人，拿人钱财不与人消灾，良心难安。嗯，现在看有一种分分钟想打脸的感觉。 人生，有钱赚，有命花，有喜欢的事做，不伤天害理，不偷鸡摸狗，那就很好了。这一直是我的准则啊，我怎么就这么想不开非要跑出去吃土创业呢？\u003C/p\u003E\u000A\u003Cp\u003E大概我骨子里就是一个闲不下来的人吧，闲下来生命就感觉空虚寂寞冷了，以我们现在的科技再加上程序员的自虐程度，能活个五六十年就不错了，生命在于折腾啊！\u003C/p\u003E\u000A\u003Cp\u003E当然，这不是一篇讲述我创业成功从此财务自由走上人生巅峰，帮儿子 [对不起，本人已婚] 迎娶白富美打造人生巅峰的励志故事。\u003C/p\u003E\u000A\u003Cp\u003E故事到这里急转直下，半年里经历了一些万万没想到的原因，创业的事情不得不终止了。创业九死一生一点都不夸张，九十九死一生都不是在吓唬人，而且九十九个死法还能不带重样的╰(￣▽￣)╮想做的事情做不了，那段时间是一个低谷期吧，人生总是要继续的，搬不了自己的砖，那就继续给别人搬砖呗。\u003C/p\u003E\u000A\u003Cp\u003E可是去哪呢？去大公司吧，我是个性格脾气都有些古怪的人，那种方圆几公里全是同事的感觉，太奇怪了。工作按照 KPI 来，这样的日子，真心话，无聊。\u003C/p\u003E\u000A\u003Cp\u003E运气不好点，在碰点办公室政治，日子过的那才叫窝心。然后老司机告诉你，你要学会站队，学会做人。我的天哪，听得鸡皮疙瘩都下来，活了都快 30 年的人了，如果是这样的工作状态，我干嘛当年还不顾家人的反对远离家乡，和别人一样送送人情，抱抱大腿，就在当地的全球 500 强国企里混混日子不也和现在处境一样？不就是不认同这样的规则么？为什么绕了一大圈我又需要变成这样的人呢？\u003C/p\u003E\u000A\u003Cp\u003E要是再惨一点，你要是碰上个技术渣的一比的老大，绩效奖金什么的，其实就是要懂得如何用 1024 种姿势拍领导马屁，哦，对了，他们管这个叫情商，你要会做人，当然对这种能力我还是挺佩服的，这事我是学不会，也懒得学。不过我自己才没有这么眼瞎好吗？！这些老大都是空降或者半路杀出来的，不过这也算是少数案例啦，但是你要是真赶上那绝对是吃不消啊。当然我是不会告诉你们我是怎么知道这事的。\u003C/p\u003E\u000A\u003Cp\u003E但是严肃点， KPI 指标的量化在落地过程中，指标是否真实的反映工作量？是否公正客观？本来就有很大的漏洞或者说是可操作空间。最常见的例子，同样的开发任务，一个人做的是脏活累活对项目是必须的，但不能为公司带来利润，一个人做的是简单的开发任务但是显著提高了公司的利润。\u003C/p\u003E\u000A\u003Cp\u003E那么问题来了，奖金是有限的，这两个人哪个人应该给更高的分数拿更多的奖金呢？答案很难统一，也很难说谁对谁错，不同的企业文化和直属领导的偏好都会影响最终的结果。\u003C/p\u003E\u000A\u003Cp\u003E还有那些奇葩的 ABCDE 档设定，一定要有人在 E 档的神奇规定，凭什么我的团队就不能每个人优秀了？我个人是非常鄙视 KPI 这种制度的，我更加鄙视那种把 KPI 引进团队的 CTO 们，特别是 KPI 不应该用在一个有高度自律性的团队中，这对团队成员是一种伤害。最后在这种奇葩的制度下，每一名工程师血液里流淌着的创造天赋在一点点被消磨，而这一份天赋公司付出了薪水，却在白白的浪费而不自知！\u003C/p\u003E\u000A\u003Cp\u003EWhy join th Navy, if you can be a pirate? 我们人类生来就是为了改造这个世界的，我一直坚信，我们可以犯错，但我们不能停下创造的脚步，只要不违法不违反自己心中的道德底线，什么事你都可以去试试。\u003C/p\u003E\u000A\u003Cp\u003E这就是我的价值观，所以结局也是显然的，再一次，我就又被自然而然的勾搭到创业公司搬砖了，这一次是排叔，蛋壳公寓的创始人之一。\u003C/p\u003E\u000A\u003Cp\u003E小排是我的前同事，也算是前领导，因为中间来客串管理过我们的项目。公司本身就是扁平化的管理，又是一群逗比，所以平常嘻嘻哈哈就过去了。\u003C/p\u003E\u000A\u003Cp\u003E排叔对项目预估一向都很客观，不急不燥，这是我很喜欢的点，不像有的老大，拍拍脑袋感觉你这个东西简单，从来不想想背后还缺什么。急功近利，互联网里这样的人太多了，能和这样的人一起做一件事，是一种幸福。\u003C/p\u003E\u000A\u003Cp\u003E\u003D\u003D\u003D\u003D\u003D这是一条华丽丽的分割线\u003D\u003D\u003D\u003D\u003D\u003C/p\u003E\u000A\u003Cp\u003E真正的故事就这么开始了，还记得开始勾搭我的时候，小排在哭穷，公司多么多么穷，我能给你的尽量给，当然给的也很有限，我们有多穷呢？穷到夫人知道我们谈的薪资标准坚决不同意我去的地步\u003D \u003D|||创业可以有，不过养家糊口也得照顾现实吧。\u003C/p\u003E\u000A\u003Cp\u003E当时电脑都是自己的，公司只配一台 23 寸的戴尔显示器，还记得我们在上海租的办公室，后面墙皮都脱落的一块一块的，这样也太寒酸了，怎么办？这时机智的嫂夫人（小排的太太）想了个办法，我们挂个世界地图吧。\u003C/p\u003E\u000A\u003Cp\u003E这个开端放在创业公司里也算是寒酸了，现在动辄拿个几千万 A 轮风投的项目，开烧投资人钱的哪家不都展示出各种对程序员无尽的关怀和无尽的福利啊，顶配 MBP ，饮料餐饮下午茶这都快是标配了，再有的一万块一把的椅子，连程序员鼓励师都已经以按摩师的姿态成功落地上线了，单身的一定要解决掉伴侣问题，就为了让这帮脑子在非技术人眼中多少有点不太正常就是能创造价值的人安心干活，我必须得承认，真的是够拼的……\u003C/p\u003E\u000A\u003Cp\u003E当然我觉得他们烧钱没错，任何一家公司愿意砸钱给哪个角色，取决于他们的业务驱动方是谁，所以你不会看到在传统企业里，把程序员们捧上天，也不会看到，在互联网公司里把 sales 捧上天。\u003C/p\u003E\u000A\u003Cp\u003E我们现在的生意，整体还是偏线下，在蛋壳，我们是强大的生产力，但我们不是业务的驱动方，我们只是幕后英雄。\u003C/p\u003E\u000A\u003Cp\u003E所以面子功夫差一点就差一点呗，而且你真以为你赚了么？你就不想想这些钱到底是拿整个公司多少股权换来的？你是愿意和创始人一起现在省一省将来大家蛋糕多分一些？还是把大蛋糕分给投资人换自己的提前享乐？\u003C/p\u003E\u000A\u003Cp\u003E当时夫人就特别不理解为什么我一定要来帮好基友搞这摊子事情，没事给自己找罪受，我觉得出来创业，一半看事情有没有前途，一半看创始团队给不给力。\u003C/p\u003E\u000A\u003Cp\u003E这些创始人都是很务实的人，我喜欢他们那一份不急功近利的心态和务实的风格。快速迭代和务实，本来就不冲突。他们真的懂。这样的人，至少在这个行业里我能遇到的人，真的不多见。\u003C/p\u003E\u000A\u003Cp\u003E从事情上看，在外行人眼中，几乎所有人都觉得我们是二房东，是的我们在你们眼中很 Low ，但我们做的东西未必 Low 。我们内心还是拒绝这个称呼的好吗？我只喜欢站着还能把钱赚了的生意，这件事情从内心讲我并不认为足够的高尚，但是在国情下，这绝对是一种合理的解决方案。在这个越来越多的年轻人涌入到北上广深谋出路的时代，帮他们住的好一点，我们也赚一些钱，对彼此都不是坏事。\u003C/p\u003E\u000A\u003Cp\u003E而且这门生意比我能在这聊天扯淡的空间多的多，其实游戏才刚刚开始，不过篇幅有限，暂时大家也可以理解为二房东。好的生意都是能用一句话说清楚盈利模式的。 二房东三个字足以让大家简单理解。\u003C/p\u003E\u000A\u003Cp\u003E可话说回来，就算是二房东，二房东会帮你提供免费公共区域双周保洁么？二房东会遵循国家标准，不违章改造么？二房东会在改造房屋时，注重隔音效果好坏么？二房东会给你使用环保的装修家具和材料么？不用付三押一，不用担心黑中介，换工作了现在住的房子离公司远，还能免扣押金换个同样蛋壳公寓的屋子，这样厚道又机智的二房东你从哪里找？\u003C/p\u003E\u000A\u003Cp\u003E如果放在八九年前北漂的我，我能遇到这样的房东，我很激动的就签签签，住住住了好吗？就连票房收割 10 亿+做《煎饼侠》的大鹏导演曾经都分享成功经验提到“当年搜狐在哪，他把房子租到哪，为的比别人多一个机会”。虽然我们这种职业，不怎么需要他那样争取机会的模式，闷声做东西就行了，但是你要知道，八九年前还没有这些牛逼的 iphone ， kindle 这些可以充分利用碎片时间的装备，你的时间也是钱啊！周边太贵住不起，黑心房东隔断房简直就不把人当人，要么忍要么滚，做不到鹏哥的忍耐力，当然或许真相是也许没人家薪水多 T_T 所以只好住的远一点，上下班一天奔波三个小时，中途还遭遇过房东说退就退的尴尬境遇，通常做法都是我按合同补你钱啊，实际上租客没有话语权，补钱搬家什么的哪里划算了？周边房价一涨，再租更贵，还有搬家的成本，再找中介的中介费！都是一把辛酸泪。\u003C/p\u003E\u000A\u003Cp\u003E每个人不同的阶段，都有不同的烦恼，这个阶段的我，找个工作容易，找个公司钱景大好的 \u0026amp\u003B\u0026amp\u003B 能从零开始一点点打造心目中技术金字塔的公司，很难。蛋壳公寓，是一家。\u003C/p\u003E\u000A\u003Cp\u003E虽然这家公司成立一年多，但是技术团队的真正搭建并没有多久，进入这家公司半年多，创业之初，着实不易，其实我们遭遇了很多很多可笑可气又奇葩的事。没办法，这就是创业，你不能只想拥有他成长光鲜的一面，而不去经历成长的烦恼。创业，她有光鲜的外衣，也有内心的苦楚。\u003C/p\u003E\u000A\u003Cp\u003E当时上海的办公室为了考虑地段，但是预算有限啊，只能牺牲设施条件，我们租了一间商住合一的公寓，名字都带公寓。这为我们带来不让尴尬的处境……\u003C/p\u003E\u000A\u003Cp\u003E记得有一次电面个妹纸，她最后问我，你们不会是骗纸吧…… 我后来机智的回答说：“妹纸，我们不是，你不要误会，我们真的不是坏人，虽然从骗纸的行骗手段来说，确实租在这种地方很像骗纸，但是你见过电面这么专业的骗纸么？而且这种骗纸通常都是骗取中介费，我们面试不收钱的好不好？骗色的也有，但是违法成本太高，一般人没这个胆，而且你不放心可以叫几个汉纸过来一起面，完全没问题，你甚至可以提前报警……” 从此我的人生又多了一条尴尬的人生经验。\u003C/p\u003E\u000A\u003Cp\u003E我们还经历过好不容易招来一个前端，当时虽然感觉这个人有点心浮气躁，但是缺人啊，我跟排商量了下就放进来了（再一次证明，请不要违反 Hire slow,Fire fast 原则），结果这哥们周五报到，周一来上班一天，周二直接招呼不打就跑路了……\u003C/p\u003E\u000A\u003Cp\u003E我还记得周二我到公司，嫂夫人告诉我说：“这哥们好像不来了，你看桌子上的杯子都收走了。” 我都不敢相信，微信发消息，电话打了好几个都没人接，卧槽我的脑洞不由自主的扩散都开始想这哥们不会是在自己屋子里猝死了吧，我们这行很容易猝死的啊！！！这孩子在外面打拼也不容易，合同上好像也没留个紧急联系人的，他父母会不会担心啊？尼玛合同上为什么没设置紧急联系人啊，尼玛怎么设计合同的啊！以后合同要改进好不好，唉不对正事要紧……急得我都想打 110 报警了。\u003C/p\u003E\u000A\u003Cp\u003E直到过了三四天我在想最近上海也没报出什么某年轻男子猝死家中尸体腐烂邻居报警之类的新闻应该确实是跑路了，不过安全起见，我又使用各种搜索技能挖出他某乎的账号，这哥们居然在发帖，是的，他在发帖！！！当然知道他活着，虽然被坑了，我也就放心了。但我当时内心突然真是十万只草泥马奔腾而过啊！ WTF 啊尼玛！卷了我们项目一个多月的工作成果跑路这是什么素质啊！而且看样子他好像不声不响的还在之前那家公司继续工作着啊卧艹艹艹艹！！！虽然半年后这代码我都觉得垃圾不屑一看但你这样的行为简直是个渣渣啊！我祝你人贱有天收好不好！！！\u003C/p\u003E\u000A\u003Cp\u003E后来还有个实习生，做的也不咋地（当时和那个小哥前后脚入职的，同样违反了 Hire slow,Fire fast 原则）开了。小的创业公司，没什么名气，我也是个懒得到处去刷脸的人，也没空勾搭人。于是盛怒之下，算了，不招了，一个人大不了累点燃烧点生命，两条大产品线一个人撸，上个 0.1 版本还是能扛得住的。\u003C/p\u003E\u000A\u003Cp\u003E于是就这样，半年多过去了，我们的很多功能也就这样一点点的扛了过来。在这期间，我们的工作模式也发生了变化。\u003C/p\u003E\u000A\u003Cp\u003E从最开始小排勾搭我的 remote 模式到全职模式，我想了想还是觉得全职模式比较好，不过后来在一天 4 小时车程的碾压下，我从一个书虫已经变成了看书看到想吐的结局，最后还是走上了 remote 模式。最后又发展为整个技术团队（一共 4 个人，其中还有一个实习生）走上了 remote 模式。再到后来，小排直接把上海的办公室退掉了，公司总部在北京，我们相约定期去北京做 review 。从此过上了相约星期六，有情就牵手， 见面不是基，面基才是基的生活。\u003C/p\u003E\u000A\u003Cp\u003E于是这半年的职业生涯我就变成了这样的：\u003C/p\u003E\u000A\u003Cp\u003E在别人家的办公室 Coding ……\u003Cbr\u003E\u000A[我建议不要去不搞互联网的公司……原因是网！太！烂！啦！]\u003C/p\u003E\u000A\u003Cp\u003E在火车上 Coding ……\u003Cbr\u003E\u000A[感谢中国电信，高铁全程覆盖，感谢降噪耳机，世界仍然是安静的……]\u003C/p\u003E\u000A\u003Cp\u003E在景区 Coding ……\u000A[成为别人的外挂，有山有水有代码，哎呦，不错哦……]\u003C/p\u003E\u000A\u003Cp\u003E在家里 Coding ……\u000A[爸爸，爸爸，这个是 A …… 这个是 W …… 哎哎哎~~等下、等下我的代码……感谢 History 功能……]\u003C/p\u003E\u000A\u003Cp\u003E在咖啡厅 Coding ……\u000A[唉……隔壁又在很大声的聊，我的项目是做…… 我现在需要 x 百万美金……我手抖都不带抖的继续 Coding ……今天都没有报价过千万的，排名不行啊]\u003C/p\u003E\u000A\u003Cp\u003E其实有时候想想，这样的状态，也还不错。\u000A虽然身心在这家公司被需求方轮了那真是一遍又一遍 O__O\u0022…\u000A可在其他厂不还是一样被轮？虽然可能轮的没那么复杂没那么闹心没那么丧心病狂……何况解决一个复杂的问题，比解决一个简单的问题成就感高多了好么？\u003C/p\u003E\u000A\u003Cp\u003E“生活不只眼前的苟且，还有诗和远方的田野。”我现在两者不都同时拥有了吗？还有什么好烦恼的呢？\u003C/p\u003E\u000A\u003Cp\u003E以前我还挺担心 remote 效率的，实际体验下来，其实效果很好，当然了，已婚的如果没人帮带孩子， remote 你还是别考虑了。\u003C/p\u003E\u000A\u003Cp\u003E\u003D\u003D\u003D\u003D\u003D这是一条华丽丽的分割线\u003D\u003D\u003D\u003D\u003D\u003C/p\u003E\u000A\u003Cp\u003E最重要的是，我们现在从探索期进入了稳定探索期，工作配置也越来越好了，公司正式给开发配置了 MBA ，我们的配置终于跟上了业界标准，争取明年实现高大上， MBP 什么的，走起来。至少现在我有勇气可以跳出来勾搭勾搭人了，太苦的坑，我是不会让你们跳的。\u003C/p\u003E\u000A\u003Cp\u003E经过我们这段时间的 remote 尝试，我和需求方对 remote 方式是完全认可的，当然啦！并不是所有的业务都适合做 remot ，各位看官请自行根据业务评估是否适合 remote ，千万别盲目套用，不过我们可以确定我们的业务线非常适用，接下来，我们需要把 0.1 版的产品推到 0.8 版。\u003C/p\u003E\u000A\u003Cp\u003E所以，有兴趣入坑的 python 同学注意了，这里有 2 个钱景不错的工作机会等你来哦，不拒绝新手，毕竟前期很多脏活累活都撸清楚了，没有以前那么夸张的强压任务，当然快速迭代还是需要的：\u003C/p\u003E\u000A\u003Cp\u003E产品方向：\u003C/p\u003E\u000A\u003Cul\u003E\u000A\u003Cli\u003E实现数据和公司流程相关的产品\u003C/li\u003E\u000A\u003C/ul\u003E\u000A\u003Cp\u003E工作内容：\u003C/p\u003E\u000A\u003Cul\u003E\u000A\u003Cli\u003E在业务框架上实现业务功能，基于 Django 实现\u003C/li\u003E\u000A\u003Cli\u003E竞争对手数据监控\u003C/li\u003E\u000A\u003C/ul\u003E\u000A\u003Cp\u003E技术栈：\u003C/p\u003E\u000A\u003Cul\u003E\u000A\u003Cli\u003E熟练使用 django 、 scrapy\u003C/li\u003E\u000A\u003Cli\u003E熟练使用 mysql\u003C/li\u003E\u000A\u003Cli\u003E熟练使用 redis\u003C/li\u003E\u000A\u003Cli\u003E熟悉 html/js/css\u003C/li\u003E\u000A\u003Cli\u003E无 github 账户者不考虑\u003C/li\u003E\u000A\u003C/ul\u003E\u000A\u003Cp\u003E人品栈：\u003C/p\u003E\u000A\u003Cul\u003E\u000A\u003Cli\u003E善良\u003C/li\u003E\u000A\u003Cli\u003E诚实\u003C/li\u003E\u000A\u003Cli\u003E聪明 [聪明这种属性我一直想不明白干嘛大家都列出来呢？\u000A如何证明一个人当前的成果是努力来的还是天赋呢？]\u003C/li\u003E\u000A\u003C/ul\u003E\u000A\u003Cp\u003E希望你们都是能独当一面的勇士。\u000A工作地点为 remote ，但要求 base 在上海或北京，上海范围至多江浙沪。定期可以出来聚一聚、吃吃饭、扯扯淡。\u003C/p\u003E\u000A\u003Cp\u003E另外，虽然是 remote ，你不能失联，我的标准是：\u003C/p\u003E\u000A\u003Cp\u003E工作的 8 小时时间内， 5 分钟甚至是绝大多数时间即时回复，我认为这个要求不过分。 工作之外的时间，不做特别硬性的规定，但至少我们都是一群精力过剩的晚上 23 点还能抓到的人，真有事情需要能找到人，这也算是 remote 的缺点吧。在我看来，并无所谓，创业，只是一种生活态度。希望能遇到志同道合的人。\u003C/p\u003E\u000A\u003Cp\u003E欢迎推荐或自荐，有意向者，请发送简历及期望薪酬至 wangwenpei@dankegongyu.com\u003C/p\u003E\u000A\u003Cp\u003E按国际惯例总要介绍下自己，虽然说了其实别人也不知道是谁，世界这么大，谁知道谁是谁，何况我又不是小网红，有兴趣还是来一起共事吧 XD\u003C/p\u003E\u000A\u003Cp\u003E在公司大家一般都叫我风 xx （已经默默的被接受了这个花名，你们这群文盲…… 算了花名好记点也没坏处），性别直男无癌，已婚。\u003C/p\u003E\u000A\u003Cp\u003E我在这家公司担任架构师的职务，从业差不多 10 年，就职过大概四、五家公司，大中小都呆过，名字表过不提了吧，有喜欢的公司，也有看不起的公司。\u003C/p\u003E\u000A\u003Cp\u003E有上市的、有被并购的，还有上市后被出售的， 10 年过去回头看看真是唏嘘不已，这大概就是互联网的江湖吧，我也不过是整个江湖中的一粒沙而已。\u003C/p\u003E\u000A\u003Cp\u003E一般会被人当 Full Stack ，但我始终觉得是种调侃╮(╯▽╰)╭我也不知道这词啥时候火的，反正我觉得自己只是一名工程师而已，无非活久见，撸着撸着就跨界了，骨子里有那么点文艺气息以及作死之力？所以对跨界的事也不并嫌弃，不然也不会这么能唠跟你唠这十块钱的。\u003C/p\u003E\u000A\u003Cp\u003E其实我一直觉得好的产品就是科技与人文的结合体，只保持工程师思维最多只能保证架构的稳定，但没有办法做出优秀的产品，而且很有可能最终你的架构因为视角太小都会是糟糕的，讲这话有点心虚，毕竟我又不是小网红，怕被骂神经病，没啥影响力，所以摆出大神辟邪，前几天正好看到的一个纪录片，内心产生了不能自已的共鸣，要喷请先喷他 XD\u003C/p\u003E\u000A\u003Cp\u003E个人成就上一直在为公司贡献代码，对内的、对外的、注重并发的、注重大数据的都有负责或参与过，公司的项目就不自曝了，免得回头踩线你们懂得。\u003C/p\u003E\u000A\u003Cp\u003E开源的东西，目前没有什么特别牛逼的拿得出手的开源项目，现在 star 数量最多的大概是给 mongoengine （级别 1000+ star ）加过点 feature ，开发中用到的开源项目，有空我都会 hack 一点，社区运作规范活跃，做测试用例简单的话有时候我也会回馈给开源社区。比起各种大牛来，前方路途仍然遥远，同志仍需努力。\u003C/p\u003E\u000A\u003Cp\u003E个人还是很喜欢 django 和 python ，不管现在的技术趋势如何，重要的是能坚持深入。大概就是这样，以上情况本人承诺真实有效，可自行去 \u003Ca href\u003D\u0022https://github.com/9nix00\u0022 rel\u003D\u0022nofollow\u0022\u003Ehttps://github.com/9nix00\u003C/a\u003E 人肉围观验证。求吐槽手下留情。\u003C/p\u003E\u000A\u003Cp\u003E总之，希望能遇到和自己有相同想法的人，一起来把这件事情做成。 符合技术栈对 remote 也能适应的小伙伴欢迎投递简历至 wangwenpei@dankegongyu.com ，注明岗位和期望薪酬，附 github 账号、作品。没 github 的对不起我们不收。\u003C/p\u003E\u000A\u003Cp\u003E福利上，如上所说：\u003C/p\u003E\u000A\u003Cul\u003E\u000A\u003Cli\u003E现在终于爬到了标准段位， MBA 什么的是终于可以上了。\u003C/li\u003E\u000A\u003Cli\u003E有一份 99%的商业医疗保险\u003C/li\u003E\u000A\u003Cli\u003E股票期权，目前策略是半年发一次。\u003C/li\u003E\u000A\u003Cli\u003Eremote ？如果这个也算的话。\u003C/li\u003E\u000A\u003C/ul\u003E\u000A\u003Cp\u003E创业与我，是一种生活态度，有钱赚，有命花，能做有趣的事情，家庭美满，我想是很多工程师心中一个简单而又美好的梦想。欢迎乘上这艘快船，一起踏上征程，无论结局如何，我始终相信一点，努力过的人，结局都不会太差。\u003C/p\u003E\u000A\u003Cp\u003E风爻\u003C/p\u003E\u000A",
        "replies" : 71,
        "member" : {
            "id" : 105096,
            "username" : "9nix00",
            "tagline" : "",
            "avatar_mini" : "//cdn.v2ex.co/avatar/146d/4e12/105096_mini.png?m=1469586077",
            "avatar_normal" : "//cdn.v2ex.co/avatar/146d/4e12/105096_normal.png?m=1469586077",
            "avatar_large" : "//cdn.v2ex.co/avatar/146d/4e12/105096_large.png?m=1469586077"
        },
        "node" : {
            "id" : 300,
            "name" : "programmer",
            "title" : "程序员",
            "title_alternative" : "Programmer",
            "url" : "http://www.v2ex.com/go/programmer",
            "topics" : 12690,
            "avatar_mini" : "//cdn.v2ex.co/navatar/94f6/d7e0/300_mini.png?m=1469447538",
            "avatar_normal" : "//cdn.v2ex.co/navatar/94f6/d7e0/300_normal.png?m=1469447538",
            "avatar_large" : "//cdn.v2ex.co/navatar/94f6/d7e0/300_large.png?m=1469447538"
        },
        "created" : 1469509527,
        "last_modified" : 1469509527,
        "last_touched" : 1469591452
    },
    
    {
        "id" : 295096,
        "title" : "Uber 拼车价格好像每个人不太一样？",
        "url" : "http://www.v2ex.com/t/295096",
        "content" : "今天准备叫车的时候用女朋友的手机试了一下，发现同一个位置叫拼车的价格不一样，而且差距很大。\u000D\u000A她的显示是 7.51 ，我的是 12.71 ，都快差出一倍了。\u000D\u000A以前这段距离我手机显示的也是 7 块左右。\u000D\u000A上车位置特意手动输入的相同位置，下车位置也是。拼车人数都选的是一个人。两个账号都是 4.99 星。\u000D\u000AV 友有遇到类似问题的吗，还是 Uber 的拼车价格本身就是分人的？\u000D\u000A\u000D\u000A图片附上：\u000D\u000Ahttp://ww2.sinaimg.cn/large/67d445b7jw1f67iwnkhbej20hs0vkn0t.jpg\u000D\u000Ahttp://ww2.sinaimg.cn/large/67d445b7jw1f67iwexy6ej20k00zkq6f.jpg",
        "content_rendered" : "今天准备叫车的时候用女朋友的手机试了一下，发现同一个位置叫拼车的价格不一样，而且差距很大。\u000D\u003Cbr /\u003E她的显示是 7.51 ，我的是 12.71 ，都快差出一倍了。\u000D\u003Cbr /\u003E以前这段距离我手机显示的也是 7 块左右。\u000D\u003Cbr /\u003E上车位置特意手动输入的相同位置，下车位置也是。拼车人数都选的是一个人。两个账号都是 4.99 星。\u000D\u003Cbr /\u003EV 友有遇到类似问题的吗，还是 Uber 的拼车价格本身就是分人的？\u000D\u003Cbr /\u003E\u000D\u003Cbr /\u003E图片附上：\u000D\u003Cbr /\u003E\u003Cimg src\u003D\u0022http://ww2.sinaimg.cn/large/67d445b7jw1f67iwnkhbej20hs0vkn0t.jpg\u0022 class\u003D\u0022embedded_image\u0022 border\u003D\u00220\u0022 /\u003E \u000D\u003Cbr /\u003E\u003Cimg src\u003D\u0022http://ww2.sinaimg.cn/large/67d445b7jw1f67iwexy6ej20k00zkq6f.jpg\u0022 class\u003D\u0022embedded_image\u0022 border\u003D\u00220\u0022 /\u003E ",
        "replies" : 56,
        "member" : {
            "id" : 104797,
            "username" : "StYu",
            "tagline" : "我去做一件事并不是因为他简单，而是因为它值得。",
            "avatar_mini" : "//cdn.v2ex.co/avatar/2937/aa28/104797_mini.png?m=1450090803",
            "avatar_normal" : "//cdn.v2ex.co/avatar/2937/aa28/104797_normal.png?m=1450090803",
            "avatar_large" : "//cdn.v2ex.co/avatar/2937/aa28/104797_large.png?m=1450090803"
        },
        "node" : {
            "id" : 802,
            "name" : "uber",
            "title" : "Uber",
            "title_alternative" : "Uber",
            "url" : "http://www.v2ex.com/go/uber",
            "topics" : 56,
            "avatar_mini" : "//cdn.v2ex.co/navatar/1141/938b/802_mini.png?m=1428258119",
            "avatar_normal" : "//cdn.v2ex.co/navatar/1141/938b/802_normal.png?m=1428258119",
            "avatar_large" : "//cdn.v2ex.co/navatar/1141/938b/802_large.png?m=1428258119"
        },
        "created" : 1469531821,
        "last_modified" : 1469531821,
        "last_touched" : 1469591717
    },
    
    {
        "id" : 295117,
        "title" : "迷茫的高三学生 （准备复读了）",
        "url" : "http://www.v2ex.com/t/295117",
        "content" : "第一次在 v2 上发帖，感受到了大家的热情。\u000D\u000A\u000D\u000A不知道大家对那个高三学生还有没有印象，离上一次发帖已经 100 多天了\u000D\u000A\u000D\u000A那真不是给幕课网写的软文，由于在幕课网上发表的所以不能提到其他网站。原文中还说了网易云课堂，极客学院和实验楼\u000D\u000Ahttp://www.jianshu.com/p/7d4185a86137\u000D\u000A\u000D\u000A谢谢的大家的回复，每一条我都认真看了好几遍。 \u000D\u000A现在我已经决定复读了。 \u000D\u000A\u000D\u000A我把这些写在附言里大家好像看不到 \u000D\u000A很抱歉当时没有给你们回复，因为当时我自己很乱，也不知道说什么 \u000D\u000A\u000D\u000A现在应该捋清了 \u000D\u000Ahttp://www.jianshu.com/p/70a64f3068fc \u000D\u000A\u000D\u000A8 月 28 号就开学了，谢谢 v2 的前辈们，庆幸在这问了大家，要不现在我可能找到了新的工作，到时候可能已经来不及后悔了",
        "content_rendered" : "\u003Cp\u003E第一次在 v2 上发帖，感受到了大家的热情。\u003C/p\u003E\u000A\u003Cp\u003E不知道大家对那个高三学生还有没有印象，离上一次发帖已经 100 多天了\u003C/p\u003E\u000A\u003Cp\u003E那真不是给幕课网写的软文，由于在幕课网上发表的所以不能提到其他网站。原文中还说了网易云课堂，极客学院和实验楼\u000A\u003Ca href\u003D\u0022http://www.jianshu.com/p/7d4185a86137\u0022 rel\u003D\u0022nofollow\u0022\u003Ehttp://www.jianshu.com/p/7d4185a86137\u003C/a\u003E\u003C/p\u003E\u000A\u003Cp\u003E谢谢的大家的回复，每一条我都认真看了好几遍。\u000A现在我已经决定复读了。\u003C/p\u003E\u000A\u003Cp\u003E我把这些写在附言里大家好像看不到\u000A很抱歉当时没有给你们回复，因为当时我自己很乱，也不知道说什么\u003C/p\u003E\u000A\u003Cp\u003E现在应该捋清了\u000A\u003Ca href\u003D\u0022http://www.jianshu.com/p/70a64f3068fc\u0022 rel\u003D\u0022nofollow\u0022\u003Ehttp://www.jianshu.com/p/70a64f3068fc\u003C/a\u003E\u003C/p\u003E\u000A\u003Cp\u003E8 月 28 号就开学了，谢谢 v2 的前辈们，庆幸在这问了大家，要不现在我可能找到了新的工作，到时候可能已经来不及后悔了\u003C/p\u003E\u000A",
        "replies" : 45,
        "member" : {
            "id" : 167869,
            "username" : "zhongsheng",
            "tagline" : "",
            "avatar_mini" : "//cdn.v2ex.co/avatar/5a25/1ab1/167869_mini.png?m=1460450545",
            "avatar_normal" : "//cdn.v2ex.co/avatar/5a25/1ab1/167869_normal.png?m=1460450545",
            "avatar_large" : "//cdn.v2ex.co/avatar/5a25/1ab1/167869_large.png?m=1460450545"
        },
        "node" : {
            "id" : 300,
            "name" : "programmer",
            "title" : "程序员",
            "title_alternative" : "Programmer",
            "url" : "http://www.v2ex.com/go/programmer",
            "topics" : 12690,
            "avatar_mini" : "//cdn.v2ex.co/navatar/94f6/d7e0/300_mini.png?m=1469447538",
            "avatar_normal" : "//cdn.v2ex.co/navatar/94f6/d7e0/300_normal.png?m=1469447538",
            "avatar_large" : "//cdn.v2ex.co/navatar/94f6/d7e0/300_large.png?m=1469447538"
        },
        "created" : 1469537975,
        "last_modified" : 1469537975,
        "last_touched" : 1469591247
    },
    
    {
        "id" : 295036,
        "title" : "Chrome 版本 52.0.2743.82 (64\u002Dbit) 不支持 delete 后退了？",
        "url" : "http://www.v2ex.com/t/295036",
        "content" : "使用 command+delete 也不能后退了。。\u000D\u000A有遇到这情况的 v 友么",
        "content_rendered" : "使用 command+delete 也不能后退了。。\u000D\u003Cbr /\u003E有遇到这情况的 v 友么",
        "replies" : 43,
        "member" : {
            "id" : 53782,
            "username" : "xingshu",
            "tagline" : "",
            "avatar_mini" : "//cdn.v2ex.co/avatar/670a/6fc9/53782_mini.png?m=1389177312",
            "avatar_normal" : "//cdn.v2ex.co/avatar/670a/6fc9/53782_normal.png?m=1389177312",
            "avatar_large" : "//cdn.v2ex.co/avatar/670a/6fc9/53782_large.png?m=1389177312"
        },
        "node" : {
            "id" : 22,
            "name" : "macos",
            "title" : "macOS",
            "title_alternative" : "macOS",
            "url" : "http://www.v2ex.com/go/macos",
            "topics" : 8536,
            "avatar_mini" : "//cdn.v2ex.co/navatar/b6d7/67d2/22_mini.png?m=1467834994",
            "avatar_normal" : "//cdn.v2ex.co/navatar/b6d7/67d2/22_normal.png?m=1467834994",
            "avatar_large" : "//cdn.v2ex.co/navatar/b6d7/67d2/22_large.png?m=1467834994"
        },
        "created" : 1469517699,
        "last_modified" : 1469517699,
        "last_touched" : 1469591975
    },
    
    {
        "id" : 295071,
        "title" : "站内全文搜索采用什么方案比较快？",
        "url" : "http://www.v2ex.com/t/295071",
        "content" : "现在站点的内容到达了百万的量，突然发现原来基于 like 的站内搜索已经奇慢无比了，在网上搜了一下好像`Sphinx`是一种可行的方案，但还是有些纠结。希望大家帮忙提供一下思路",
        "content_rendered" : "\u003Cp\u003E现在站点的内容到达了百万的量，突然发现原来基于 like 的站内搜索已经奇慢无比了，在网上搜了一下好像\u003Ccode\u003ESphinx\u003C/code\u003E是一种可行的方案，但还是有些纠结。希望大家帮忙提供一下思路\u003C/p\u003E\u000A",
        "replies" : 42,
        "member" : {
            "id" : 130189,
            "username" : "wannianma",
            "tagline" : "",
            "avatar_mini" : "//cdn.v2ex.co/avatar/0619/979e/130189_mini.png?m=1438480651",
            "avatar_normal" : "//cdn.v2ex.co/avatar/0619/979e/130189_normal.png?m=1438480651",
            "avatar_large" : "//cdn.v2ex.co/avatar/0619/979e/130189_large.png?m=1438480651"
        },
        "node" : {
            "id" : 62,
            "name" : "php",
            "title" : "PHP",
            "title_alternative" : "PHP",
            "url" : "http://www.v2ex.com/go/php",
            "topics" : 2026,
            "avatar_mini" : "//cdn.v2ex.co/navatar/44f6/83a8/62_mini.png?m=1468225360",
            "avatar_normal" : "//cdn.v2ex.co/navatar/44f6/83a8/62_normal.png?m=1468225360",
            "avatar_large" : "//cdn.v2ex.co/navatar/44f6/83a8/62_large.png?m=1468225360"
        },
        "created" : 1469525574,
        "last_modified" : 1469525574,
        "last_touched" : 1469589634
    },
    
    {
        "id" : 294995,
        "title" : "你们的公司都有发布系统吗",
        "url" : "http://www.v2ex.com/t/294995",
        "content" : "用起来感觉如何,有什么比较让你惊喜的功能?或者是值得吐槽的地方",
        "content_rendered" : "用起来感觉如何,有什么比较让你惊喜的功能?或者是值得吐槽的地方",
        "replies" : 33,
        "member" : {
            "id" : 127945,
            "username" : "yongzhong",
            "tagline" : "",
            "avatar_mini" : "//cdn.v2ex.co/avatar/0e5d/3258/127945_mini.png?m=1438250711",
            "avatar_normal" : "//cdn.v2ex.co/avatar/0e5d/3258/127945_normal.png?m=1438250711",
            "avatar_large" : "//cdn.v2ex.co/avatar/0e5d/3258/127945_large.png?m=1438250711"
        },
        "node" : {
            "id" : 770,
            "name" : "career",
            "title" : "职场话题",
            "title_alternative" : "Career",
            "url" : "http://www.v2ex.com/go/career",
            "topics" : 1717,
            "avatar_mini" : "//cdn.v2ex.co/navatar/4ea0/6fbc/770_mini.png?m=1467368688",
            "avatar_normal" : "//cdn.v2ex.co/navatar/4ea0/6fbc/770_normal.png?m=1467368688",
            "avatar_large" : "//cdn.v2ex.co/navatar/4ea0/6fbc/770_large.png?m=1467368688"
        },
        "created" : 1469507169,
        "last_modified" : 1469507201,
        "last_touched" : 1469587900
    },
    
    {
        "id" : 295055,
        "title" : "谁推荐点综艺节目或者电视剧",
        "url" : "http://www.v2ex.com/t/295055",
        "content" : "感觉到了暑假，都是些低幼类的电视剧充斥着银屏啊",
        "content_rendered" : "感觉到了暑假，都是些低幼类的电视剧充斥着银屏啊",
        "replies" : 33,
        "member" : {
            "id" : 3332,
            "username" : "Mac",
            "tagline" : "",
            "avatar_mini" : "//cdn.v2ex.co/avatar/b0ab/42fc/3332_mini.png?m=1415858578",
            "avatar_normal" : "//cdn.v2ex.co/avatar/b0ab/42fc/3332_normal.png?m=1415858578",
            "avatar_large" : "//cdn.v2ex.co/avatar/b0ab/42fc/3332_large.png?m=1415858578"
        },
        "node" : {
            "id" : 12,
            "name" : "qna",
            "title" : "问与答",
            "title_alternative" : "Questions and Answers",
            "url" : "http://www.v2ex.com/go/qna",
            "topics" : 73243,
            "avatar_mini" : "//cdn.v2ex.co/navatar/c20a/d4d7/12_mini.png?m=1468770261",
            "avatar_normal" : "//cdn.v2ex.co/navatar/c20a/d4d7/12_normal.png?m=1468770261",
            "avatar_large" : "//cdn.v2ex.co/navatar/c20a/d4d7/12_large.png?m=1468770261"
        },
        "created" : 1469522459,
        "last_modified" : 1469522459,
        "last_touched" : 1469572748
    }
    
]